daveyJ-sgs/tm4c_daq/usb_dev_serial/main.c
//*****************************************************************************
//
// main.c - TM4C123G DAQ with USB CDC streaming
//
// Hardware: EK-TM4C123GXL (Tiva C Series LaunchPad)
// MCU:      TM4C123GH6PM, ARM Cortex-M4F @ 80MHz
//
// USB CDC virtual COM port streams 12-bit ADC samples at configurable rate.
// Connect device USB port (J2, side micro-B) to PC for data.
// Debug USB port (J1, top micro-B) for programming.
//
// Pin assignments:
//   PD4/PD5 - USB D-/D+ (device port J2)
//   PE3     - ADC0 AIN0 (analog input)
//   PB6     - M0PWM0 (PWM test output, wire to PE3 for self-test)
//   PF1     - Red LED (heartbeat)
//   PF2     - Blue LED (USB connected)
//   PF3     - Green LED (ADC activity)
//   PF4     - SW1 button (cycle PWM frequency)
//   PF0     - SW2 button (cycle PWM duty)
//
// Binary protocol (3 bytes per 2 × 12-bit samples):
//   Byte 0:  sA[11:4]  — clamped to 0xFE max; 0xFF reserved for commands
//   Byte 1:  sA[3:0] | sB[11:8]   (nibble boundary)
//   Byte 2:  sB[7:0]
//   Decode:  sA = (b0 << 4) | (b1 >> 4)
//            sB = ((b1 & 0x0F) << 8) | b2
//   Note:    sA is clipped at 4079 (3.287 V) to keep 0xFF free for framing
//
// Command packets (3 bytes, triplet-aligned):
//   [0xFF] [0x20 | freq_index] [0x00]   PWM frequency changed
//   [0xFF] [0x40 | duty_index] [0x00]   PWM duty changed
//   [0xFF] [0x60 | rate_index] [0x00]   ADC sample rate changed
//   [0xFF] [0x80 | oflow[11:8]] [oflow[7:0]]  ADC overflow delta report
//   [0xFF] [0xA0 | recoveries[3:0]] [0x00]     Acquisition stall recovered
//   [0xFF] [0xC0 | sub] [data]                 Burst/trigger, see below
//
// Burst capture and trigger
// -------------------------
// Streaming and burst are mutually exclusive: both use g_pui16ADCBuffer, and
// with ~1.1 KB of SRAM free there is no room for a second capture buffer.
//
// Device -> host burst subcodes (0xC0 | sub):
//   0x0 STATE    0=stream 1=idle 2=armed 3=triggered 4=full 5=draining
//   0x1 LEN_HI   0x2 LEN_LO      capture length in samples
//   0x3 TRIG_HI  0x4 TRIG_LO     trigger offset within the frame
//   0x5 RATE     sample-rate preset index used for the capture
//   0x6 FLAGS    bit0 slope (0=rising), bit1 trigger was forced/auto
//   0x8 LVL_HI   0x9 LVL_LO      trigger level this capture actually used
//   0x7 BEGIN    frame payload starts at the very next triplet
//
// Host -> device, four bytes with a 16-bit big-endian argument:
//   [0xFE] [0xC0 | sub] [argHi] [argLo]
//   0x0 ACTION   0=disarm 1=arm single 2=arm continuous 3=force trigger
//   0x1 LEVEL    trigger level 0-4095
//   0x2 SLOPE    0=rising 1=falling
//   0x3 PRE_PCT  pre-trigger window as a percent of capture length
//   0x4 LENGTH   capture length in samples (64-8192, forced even)
//   0x5 AUTO_MS  auto-trigger timeout in ms, 0 = wait indefinitely
//
//*****************************************************************************

#include <stdbool.h>
#include <stdint.h>
#include "inc/hw_ints.h"
#include "inc/hw_memmap.h"
#include "inc/hw_types.h"
#include "inc/hw_gpio.h"
#include "driverlib/adc.h"
#include "driverlib/debug.h"
#include "driverlib/fpu.h"
#include "driverlib/gpio.h"
#include "driverlib/interrupt.h"
#include "driverlib/pin_map.h"
#include "driverlib/pwm.h"
#include "driverlib/rom.h"
#include "driverlib/rom_map.h"
#include "driverlib/sysctl.h"
#include "driverlib/systick.h"
#include "driverlib/timer.h"
#include "driverlib/udma.h"
#include "driverlib/usb.h"
#include "inc/hw_adc.h"
#include "inc/hw_udma.h"
#include "usblib/usblib.h"
#include "usblib/usbcdc.h"
#include "usblib/usb-ids.h"
#include "usblib/device/usbdevice.h"
#include "usblib/device/usbdcdc.h"
#include "usb_serial_structs.h"

//*****************************************************************************
// Configuration
//*****************************************************************************
#define SYSTICKS_PER_SECOND     100
#define SYS_CLOCK_HZ            80000000

// ADC circular buffer (power of 2, sized for 500kHz DMA streaming)
#define ADC_BUFFER_SIZE         8192
#define ADC_BUFFER_MASK         (ADC_BUFFER_SIZE - 1)

// Acquisition watchdog: SysTick ticks of no new samples before we assume the
// uDMA ping-pong has stalled and rebuild it.  At the slowest preset (100 kS/s)
// a buffer completes every 2.6 ms, so 10 ticks (100 ms) cannot false-trip.
#define WATCHDOG_TICKS          10

// Burst capture limits.  The shortest capture is bounded so a frame is always
// worth drawing, and the longest is the whole shared buffer.
#define BURST_MIN_SAMPLES       64
#define BURST_MAX_SAMPLES       ADC_BUFFER_SIZE

//*****************************************************************************
// PWM frequency presets — logarithmic spread from 100 Hz to 500 kHz
//
// PWM counter is 16-bit (max period 65536), so we select the clock divider
// per-frequency to keep good duty cycle resolution at all ranges.
//
//   Freq      Divider   PWM Clock    Period   Min duty step
//   100 Hz    /64       1.25 MHz     12500    0.008%
//   1 kHz     /2        40 MHz       40000    0.0025%
//   10 kHz    /1        80 MHz       8000     0.0125%
//   20 kHz    /1        80 MHz       4000     0.025%
//   40 kHz    /1        80 MHz       2000     0.05%
//*****************************************************************************
#define NUM_FREQ_PRESETS    5

typedef struct {
    uint32_t ui32FreqHz;
    uint32_t ui32ClkDiv;        // SYSCTL_PWMDIV_x
    uint32_t ui32Period;        // PWM clock ticks per cycle
} tPWMFreqPreset;

static const tPWMFreqPreset g_psFreqPresets[NUM_FREQ_PRESETS] = {
    {    100, SYSCTL_PWMDIV_64, 12500 },
    {   1000, SYSCTL_PWMDIV_2,  40000 },
    {  10000, SYSCTL_PWMDIV_1,   8000 },
    {  20000, SYSCTL_PWMDIV_1,   4000 },
    {  40000, SYSCTL_PWMDIV_1,   2000 },
};

//*****************************************************************************
// ADC sample-rate presets
//*****************************************************************************
#define NUM_SAMPLE_RATE_PRESETS 5

