daveyJ-sgs/tm4c_daq/usb_dev_serial/main.c
static const uint32_t g_pui32SampleRateHz[NUM_SAMPLE_RATE_PRESETS] = {
    100000,
    200000,
    250000,
    333333,
    400000,
};

//*****************************************************************************
// PWM duty cycle presets (percent)
//*****************************************************************************
#define NUM_DUTY_PRESETS    5
static const uint8_t g_pui8DutyPercent[NUM_DUTY_PRESETS] = {10, 25, 50, 75, 90};

//*****************************************************************************
// Global state
//*****************************************************************************

// ADC sample circular buffer
static volatile uint16_t g_pui16ADCBuffer[ADC_BUFFER_SIZE];
static volatile uint32_t g_ui32ADCHead = 0;
static volatile uint32_t g_ui32ADCTail = 0;
static volatile uint32_t g_ui32ADCOverflow = 0;
static volatile uint32_t g_ui32SampleCount = 0;
static volatile uint32_t g_ui32OverflowReported = 0;

// Acquisition watchdog state (g_ui32WatchdogLast/Ticks are SysTick-private)
static volatile bool     g_bPipelineStalled = false;
static volatile uint32_t g_ui32StallRecoveries = 0;
static uint32_t          g_ui32WatchdogLast = 0;
static uint8_t           g_ui8WatchdogTicks = 0;

//
// Burst capture / trigger state.
//
// g_pui16ADCBuffer is shared with streaming, so only one of the two can be
// live at a time.  In burst mode the same memory is a rolling pre-trigger
// window: samples are written circularly while ARMED, and on the trigger edge
// we remember where the record starts and count down the post-trigger
// samples.  The record is therefore always contiguous modulo ADC_BUFFER_MASK
// and the trigger always lands at offset g_ui32ActivePre.
//
typedef enum
{
    BURST_OFF = 0,          // streaming; burst subsystem idle
    BURST_IDLE,             // burst engaged, not armed; samples discarded
    BURST_ARMED,            // filling the pre-trigger window, hunting the edge
    BURST_TRIGGERED,        // edge found, filling the post-trigger window
    BURST_FULL,             // capture complete, buffer frozen
    BURST_DRAINING          // sending the frame to the host
}
tBurstState;

static volatile tBurstState g_eBurstState    = BURST_OFF;
static tBurstState          g_eReportedState = BURST_OFF;

// Configuration.  Written by the RX ISR at any time; snapshotted on arm, so a
// setting sent mid-capture takes effect on the next one rather than corrupting
// the record in flight.
static volatile uint16_t g_ui16TrigLevel  = 2048;
static volatile uint16_t g_ui16CaptureLen = BURST_MAX_SAMPLES;
static volatile uint16_t g_ui16AutoMs     = 0;
static volatile uint8_t  g_ui8PrePercent  = 50;
static volatile bool     g_bTrigFalling   = false;

// Live capture state (ISR-owned once armed).  Level and slope are copied here
// at arm time rather than read live: the ISR compares every sample against
// them, so a host that retunes the level mid-capture would otherwise change
// the threshold underneath a record already in progress, and the frame header
// would describe a trigger that never happened.
static volatile uint16_t g_ui16ActiveLevel  = 0;
static volatile bool     g_bActiveFalling   = false;
static volatile bool     g_bBurstContinuous = false;
static volatile bool     g_bForceTrigger    = false;
static volatile bool     g_bTrigWasForced   = false;
static volatile uint32_t g_ui32ActiveLen    = 0;
static volatile uint32_t g_ui32ActivePre    = 0;
static volatile uint32_t g_ui32BurstWrite   = 0;
static volatile uint32_t g_ui32BurstFill    = 0;
static volatile uint32_t g_ui32BurstStart   = 0;
static volatile uint32_t g_ui32PostRemain   = 0;
static volatile uint16_t g_ui16PrevSample   = 0;
static volatile uint32_t g_ui32ArmTick      = 0;
static volatile uint32_t g_ui32CaptureCount = 0;

// Drain cursor (main-loop private)
static uint32_t          g_ui32DrainPos  = 0;
static uint32_t          g_ui32DrainLeft = 0;

// Burst command staging (RX ISR -> main loop)
static volatile bool     g_bCmdBurst      = false;
static volatile uint8_t  g_ui8BurstAction = 0;

// System state
static volatile uint32_t g_ui32SysTickCount = 0;
volatile bool g_bUSBConfigured = false;

// PWM state
static volatile uint8_t g_ui8FreqIndex = 2;    // Start at 10 kHz
static volatile uint8_t g_ui8DutyIndex = 2;    // Start at 50%
static volatile uint8_t g_ui8SampleRateIndex = 1; // Start at 200 kS/s

// Button debounce (two buttons)
#define BTN_FREQ    0       // SW1 (PF4) - cycle frequency
#define BTN_DUTY    1       // SW2 (PF0) - cycle duty
#define DEBOUNCE_TICKS  8   // 80ms at 100Hz SysTick

static struct {
    uint8_t  ui8State;      // Debounced state (1=released, active low)
    uint8_t  ui8Count;      // Debounce counter
    volatile bool bPressed; // Set on press, cleared by main loop
} g_sButtons[2] = {
    {1, 0, false},          // SW1
    {1, 0, false},          // SW2
};

// PC command state (set by RxHandler, processed in main loop)
static volatile bool g_bCmdFreq = false;
static volatile bool g_bCmdDuty = false;
static volatile bool g_bCmdSampleRate = false;
static volatile uint8_t g_ui8CmdFreqIndex = 0;
static volatile uint8_t g_ui8CmdDutyIndex = 0;
static volatile uint8_t g_ui8CmdSampleRateIndex = 0;

// USB batch write buffer for high-throughput streaming
// Must be a multiple of 3 (3 bytes per 2-sample triplet)
#define USB_BATCH_BYTES     768

static uint8_t g_pui8USBBatch[USB_BATCH_BYTES];

// Pending status triplets (command echoes, overflow reports, stall recoveries).
//
// Status must never be dropped: a vanished overflow report hides data loss, and
// a lost command echo leaves the GUI's indicators disagreeing with the firmware.
// Reserving space at the top of the TX buffer did not work -- under sustained
// saturation the stream still consumed it and status went out at zero packets
// per second.  Queue status instead and hand it the buffer BEFORE bulk data, so
// it is retried until it fits rather than discarded.  The cost is negligible:
// at 400 kS/s the overflow rate needs ~39 triplets/s, ~120 B/s out of ~358 kB/s.
#define STATUS_QUEUE_SIZE   16      // power of 2
#define STATUS_QUEUE_MASK   (STATUS_QUEUE_SIZE - 1)
static volatile uint8_t g_pui8StatusQueue[STATUS_QUEUE_SIZE][2];
static volatile uint8_t g_ui8StatusHead = 0;
static volatile uint8_t g_ui8StatusTail = 0;


