daveyJ-sgs/tm4c_daq/usb_dev_serial/main.c
// uDMA control table — must be 1024-byte aligned in SRAM
static uint8_t g_pui8DMAControlTable[1024] __attribute__((aligned(1024)));

// DMA ping-pong buffers (32-bit: ADC FIFO register is 32-bit)
#define DMA_BUFFER_SIZE     256
static uint32_t g_pui32DMABufA[DMA_BUFFER_SIZE];
static uint32_t g_pui32DMABufB[DMA_BUFFER_SIZE];

//*****************************************************************************
// Error handler (DEBUG builds only)
//*****************************************************************************
#ifdef DEBUG
void
__error__(char *pcFilename, uint32_t ui32Line)
{
    while(1)
    {
    }
}
#endif

//*****************************************************************************
// PWM helper: apply current frequency and duty settings
//*****************************************************************************
static void
PWMApplySettings(void)
{
    const tPWMFreqPreset *psFreq = &g_psFreqPresets[g_ui8FreqIndex];
    uint32_t ui32PulseWidth;

    //
    // Compute pulse width from period and duty percentage
    //
    ui32PulseWidth = psFreq->ui32Period * g_pui8DutyPercent[g_ui8DutyIndex]
                     / 100;
    if(ui32PulseWidth < 1) ui32PulseWidth = 1;
    if(ui32PulseWidth >= psFreq->ui32Period) ui32PulseWidth = psFreq->ui32Period - 1;

    //
    // Disable output, reconfigure, re-enable
    //
    MAP_PWMOutputState(PWM0_BASE, PWM_OUT_0_BIT, false);
    MAP_PWMGenDisable(PWM0_BASE, PWM_GEN_0);

    MAP_SysCtlPWMClockSet(psFreq->ui32ClkDiv);
    MAP_PWMGenPeriodSet(PWM0_BASE, PWM_GEN_0, psFreq->ui32Period);
    MAP_PWMPulseWidthSet(PWM0_BASE, PWM_OUT_0, ui32PulseWidth);

    MAP_PWMGenEnable(PWM0_BASE, PWM_GEN_0);
    MAP_PWMOutputState(PWM0_BASE, PWM_OUT_0_BIT, true);
}

//*****************************************************************************
// Timer helper: apply current ADC sample-rate preset
//*****************************************************************************
static void
TimerApplySampleRate(void)
{
    uint32_t ui32Load =
        (SYS_CLOCK_HZ / g_pui32SampleRateHz[g_ui8SampleRateIndex]) - 1;

    MAP_TimerDisable(TIMER0_BASE, TIMER_A);
    MAP_TimerLoadSet(TIMER0_BASE, TIMER_A, ui32Load);
    MAP_TimerEnable(TIMER0_BASE, TIMER_A);
}

//*****************************************************************************
// USB CDC Callbacks
//*****************************************************************************
uint32_t
ControlHandler(void *pvCBData, uint32_t ui32Event,
               uint32_t ui32MsgValue, void *pvMsgData)
{
    switch(ui32Event)
    {
        case USB_EVENT_CONNECTED:
            g_bUSBConfigured = true;
            USBBufferFlush(&g_sTxBuffer);
            USBBufferFlush(&g_sRxBuffer);
            MAP_GPIOPinWrite(GPIO_PORTF_BASE, GPIO_PIN_2, GPIO_PIN_2);
            break;

        case USB_EVENT_DISCONNECTED:
            g_bUSBConfigured = false;
            MAP_GPIOPinWrite(GPIO_PORTF_BASE, GPIO_PIN_2, 0);
            break;

        case USBD_CDC_EVENT_GET_LINE_CODING:
        case USBD_CDC_EVENT_SET_LINE_CODING:
            break;

        case USBD_CDC_EVENT_SET_CONTROL_LINE_STATE:
            //
            // Host opened (or closed) the COM port.  When DTR is asserted
            // the host just opened the port: flush any in-progress TX data so
            // the new reader starts at a clean triplet boundary.
            //
            if(ui32MsgValue & 0x01)     // bit 0 = DTR
            {
                USBBufferFlush(&g_sTxBuffer);
            }
            break;

        case USBD_CDC_EVENT_SEND_BREAK:
        case USBD_CDC_EVENT_CLEAR_BREAK:
        case USB_EVENT_SUSPEND:
        case USB_EVENT_RESUME:
            break;

        default:
            break;
    }

    return(0);
}

uint32_t
TxHandler(void *pvCBData, uint32_t ui32Event, uint32_t ui32MsgValue,
          void *pvMsgData)
{
    return(0);
}

//*****************************************************************************
// Apply a burst/trigger configuration word from the host (RX ISR context)
//
// Only ACTION needs main-loop work -- the rest are plain stores that the arm
// path snapshots, so they are safe to take at any point in a capture.
//*****************************************************************************
static void
BurstCommand(uint8_t ui8Sub, uint16_t ui16Arg)
{
    switch(ui8Sub)
    {
        case 0x0:                           // ACTION
            g_ui8BurstAction = (uint8_t)ui16Arg;
            g_bCmdBurst = true;
            break;

        case 0x1:                           // LEVEL
            g_ui16TrigLevel = (ui16Arg > 4095) ? 4095 : ui16Arg;
            break;

        case 0x2:                           // SLOPE
            g_bTrigFalling = (ui16Arg != 0);
            break;

        case 0x3:                           // PRE_PCT
            g_ui8PrePercent = (ui16Arg > 95) ? 95 : (uint8_t)ui16Arg;
            break;

        case 0x4:                           // LENGTH
        {
            uint16_t ui16Len = ui16Arg;
            if(ui16Len > BURST_MAX_SAMPLES) { ui16Len = BURST_MAX_SAMPLES; }
            if(ui16Len < BURST_MIN_SAMPLES) { ui16Len = BURST_MIN_SAMPLES; }
            g_ui16CaptureLen = (uint16_t)(ui16Len & 0xFFFE);
            break;
        }

        case 0x5:                           // AUTO_MS
            g_ui16AutoMs = ui16Arg;
            break;

        default:
            break;
    }
}

uint32_t
RxHandler(void *pvCBData, uint32_t ui32Event, uint32_t ui32MsgValue,
          void *pvMsgData)
{
    switch(ui32Event)
    {
        case USB_EVENT_RX_AVAILABLE:
        {
            uint8_t ui8Char;
            static uint8_t ui8RxState = 0;
            static uint8_t ui8RxCode  = 0;
            static uint8_t ui8RxArgHi = 0;

            while(USBBufferRead((tUSBBuffer *)&g_sRxBuffer, &ui8Char, 1))
            {
                //
                // [0xFE] [code|index]                two-byte preset commands
                // [0xFE] [0xC0|sub] [argHi] [argLo]  four-byte burst commands
                //
                // The code byte is masked with 0xE0, not 0x60: the burst codes
                // set bit 7 and the old mask would have aliased 0xC0 onto
                // 0x40, turning a trigger setting into a duty-cycle change.
                //
                if(ui8RxState == 0)
                {
                    if(ui8Char == 0xFE)
                        ui8RxState = 1;
                }
                else if(ui8RxState == 1)
                {
                    if((ui8Char & 0xE0) == 0xC0)
                    {
                        ui8RxCode  = ui8Char;
                        ui8RxState = 2;
                    }
                    else
                    {
                        uint8_t idx = ui8Char & 0x0F;
                        ui8RxState = 0;
                        if((ui8Char & 0xE0) == 0x20)
                        {
                            if(idx < NUM_FREQ_PRESETS)
                            {
                                g_ui8CmdFreqIndex = idx;
                                g_bCmdFreq = true;
                            }
                        }
                        else if((ui8Char & 0xE0) == 0x40)
                        {
                            if(idx < NUM_DUTY_PRESETS)
                            {
                                g_ui8CmdDutyIndex = idx;
                                g_bCmdDuty = true;
                            }
                        }
                        else if((ui8Char & 0xE0) == 0x60)
                        {
                            if(idx < NUM_SAMPLE_RATE_PRESETS)
                            {
                                g_ui8CmdSampleRateIndex = idx;
                                g_bCmdSampleRate = true;
                            }
                        }
                    }
                }
                else if(ui8RxState == 2)
                {
                    ui8RxArgHi = ui8Char;
                    ui8RxState = 3;
                }
                else
                {
                    ui8RxState = 0;
                    BurstCommand(ui8RxCode & 0x0F,
                                 ((uint16_t)ui8RxArgHi << 8) | ui8Char);
                }
            }
            break;
        }

        case USB_EVENT_DATA_REMAINING:
            return(0);

        case USB_EVENT_REQUEST_BUFFER:
            return(0);

        default:
            break;
    }

    return(0);
}

//*****************************************************************************
// Debounce helper — called from SysTick for each button
//*****************************************************************************
static inline void
DebounceButton(uint32_t ui32Idx, uint8_t ui8Raw)
{
    if(ui8Raw != g_sButtons[ui32Idx].ui8State)
    {
        g_sButtons[ui32Idx].ui8Count++;
        if(g_sButtons[ui32Idx].ui8Count >= DEBOUNCE_TICKS)
        {
            g_sButtons[ui32Idx].ui8State = ui8Raw;
            g_sButtons[ui32Idx].ui8Count = 0;
            if(ui8Raw == 0)                 // Just pressed (active low)
            {
                g_sButtons[ui32Idx].bPressed = true;
            }
        }
    }
    else
    {
        g_sButtons[ui32Idx].ui8Count = 0;
    }
}

//*****************************************************************************
// SysTick ISR — button debounce and heartbeat LED
//*****************************************************************************
void
SysTickIntHandler(void)
{
    g_ui32SysTickCount++;

    //
    // Poll both buttons (active low: read != 0 means released)
    //
    uint32_t ui32PortF = MAP_GPIOPinRead(GPIO_PORTF_BASE,
                                          GPIO_PIN_4 | GPIO_PIN_0);
    DebounceButton(BTN_FREQ, (ui32PortF & GPIO_PIN_4) ? 1 : 0);
    DebounceButton(BTN_DUTY, (ui32PortF & GPIO_PIN_0) ? 1 : 0);

    //
    // Acquisition watchdog.  If both ping-pong halves are ever left in
    // UDMA_MODE_STOP -- an ISR delayed past a full buffer, or a debugger halt --
    // nothing re-arms them and sampling stops silently with USB still up.
    // Detect here; repair from the main loop where the ADC ISR can be masked.
    //
    if(g_ui32SampleCount == g_ui32WatchdogLast)
    {
        if(++g_ui8WatchdogTicks >= WATCHDOG_TICKS)
        {
            g_ui8WatchdogTicks = 0;
            g_bPipelineStalled = true;
        }
    }
    else
    {
        g_ui32WatchdogLast = g_ui32SampleCount;
        g_ui8WatchdogTicks = 0;
    }

    //
    // Auto-trigger timeout.  Scope "Auto" mode: if no edge turns up within
    // g_ui16AutoMs the capture proceeds anyway so the display keeps updating.
    // The ISR only honours the force once the pre-trigger window is full, so a
    // timeout shorter than the pre-fill simply fires as soon as it can.
    //
    if((g_eBurstState == BURST_ARMED) && (g_ui16AutoMs != 0))
    {
        uint32_t ui32Elapsed = (g_ui32SysTickCount - g_ui32ArmTick) *
                               (1000 / SYSTICKS_PER_SECOND);
        if(ui32Elapsed >= g_ui16AutoMs)
        {
            g_bForceTrigger = true;
        }
    }

    //
    // Heartbeat: toggle red LED every 500ms
    //
    if((g_ui32SysTickCount % 50) == 0)
    {
        MAP_GPIOPinWrite(GPIO_PORTF_BASE, GPIO_PIN_1,
            MAP_GPIOPinRead(GPIO_PORTF_BASE, GPIO_PIN_1) ^ GPIO_PIN_1);
    }
}

//*****************************************************************************
// Process a completed DMA buffer into the ADC ring buffer
//*****************************************************************************
static void
BurstProcessBuffer(uint32_t *pui32Buf, uint32_t ui32Count)
{
    uint32_t i;

