daveyJ-sgs/tm4c_daq/usb_dev_serial/main.c
    for(i = 0; i < ui32Count; i++)
    {
        uint16_t ui16S = (uint16_t)(pui32Buf[i] & 0xFFF);

        switch(g_eBurstState)
        {
            case BURST_ARMED:
                g_pui16ADCBuffer[g_ui32BurstWrite] = ui16S;
                g_ui32BurstWrite = (g_ui32BurstWrite + 1) & ADC_BUFFER_MASK;

                if(g_ui32BurstFill < g_ui32ActivePre)
                {
                    //
                    // Still filling the pre-trigger window.  Do not look for
                    // the edge yet: triggering now would hand back a record
                    // with less history than the host asked for.
                    //
                    g_ui32BurstFill++;
                }
                else
                {
                    bool bEdge = g_bActiveFalling
                        ? ((g_ui16PrevSample >= g_ui16ActiveLevel) &&
                           (ui16S < g_ui16ActiveLevel))
                        : ((g_ui16PrevSample < g_ui16ActiveLevel) &&
                           (ui16S >= g_ui16ActiveLevel));

                    if(bEdge || g_bForceTrigger)
                    {
                        uint32_t ui32TrigSlot =
                            (g_ui32BurstWrite - 1) & ADC_BUFFER_MASK;

                        g_bTrigWasForced = (!bEdge);
                        g_bForceTrigger  = false;
                        g_ui32BurstStart =
                            (ui32TrigSlot - g_ui32ActivePre) & ADC_BUFFER_MASK;
                        g_ui32PostRemain =
                            g_ui32ActiveLen - g_ui32ActivePre - 1;
                        g_eBurstState = BURST_TRIGGERED;
                    }
                }
                break;

            case BURST_TRIGGERED:
                g_pui16ADCBuffer[g_ui32BurstWrite] = ui16S;
                g_ui32BurstWrite = (g_ui32BurstWrite + 1) & ADC_BUFFER_MASK;
                if(--g_ui32PostRemain == 0)
                {
                    g_ui32CaptureCount++;
                    g_eBurstState = BURST_FULL;
                }
                break;

            default:
                //
                // IDLE, FULL or DRAINING: keep converting so the acquisition
                // watchdog still sees progress, but discard.
                //
                break;
        }

        g_ui16PrevSample = ui16S;
    }
}

static void
ProcessDMABuffer(uint32_t *pui32Buf, uint32_t ui32Count)
{
    uint32_t i;

    if(g_eBurstState != BURST_OFF)
    {
        BurstProcessBuffer(pui32Buf, ui32Count);
        g_ui32SampleCount += ui32Count;
        return;
    }

    for(i = 0; i < ui32Count; i++)
    {
        uint32_t ui32Next = (g_ui32ADCHead + 1) & ADC_BUFFER_MASK;
        if(ui32Next != g_ui32ADCTail)
        {
            g_pui16ADCBuffer[g_ui32ADCHead] = (uint16_t)(pui32Buf[i] & 0xFFF);
            g_ui32ADCHead = ui32Next;
        }
        else
        {
            g_ui32ADCOverflow += (ui32Count - i);
            break;
        }
    }
    g_ui32SampleCount += ui32Count;
}

//*****************************************************************************
// ADC0 Sequence 3 ISR — uDMA ping-pong completion
//
// With DMA enabled, this fires per-buffer (128 samples), NOT per sample.
// At 500 kHz: ~3.9 kHz interrupt rate (vs 500 kHz without DMA).
//*****************************************************************************
void
ADC0Seq3Handler(void)
{
    MAP_ADCIntClearEx(ADC0_BASE, ADC_INT_DMA_SS3);

    //
    // Check primary buffer (A) — UDMA_MODE_STOP means transfer complete
    //
    if(MAP_uDMAChannelModeGet(UDMA_CHANNEL_ADC3 | UDMA_PRI_SELECT)
       == UDMA_MODE_STOP)
    {
        ProcessDMABuffer(g_pui32DMABufA, DMA_BUFFER_SIZE);

        MAP_uDMAChannelTransferSet(UDMA_CHANNEL_ADC3 | UDMA_PRI_SELECT,
            UDMA_MODE_PINGPONG,
            (void *)(ADC0_BASE + ADC_O_SSFIFO3),
            g_pui32DMABufA, DMA_BUFFER_SIZE);
    }

    //
    // Check alternate buffer (B)
    //
    if(MAP_uDMAChannelModeGet(UDMA_CHANNEL_ADC3 | UDMA_ALT_SELECT)
       == UDMA_MODE_STOP)
    {
        ProcessDMABuffer(g_pui32DMABufB, DMA_BUFFER_SIZE);

        MAP_uDMAChannelTransferSet(UDMA_CHANNEL_ADC3 | UDMA_ALT_SELECT,
            UDMA_MODE_PINGPONG,
            (void *)(ADC0_BASE + ADC_O_SSFIFO3),
            g_pui32DMABufB, DMA_BUFFER_SIZE);
    }

    //
    // Toggle green LED every ~131072 samples (~0.7s at 192kHz, gentle blink)
    //
    if((g_ui32SampleCount & 0x1FFFF) == 0)
    {
        MAP_GPIOPinWrite(GPIO_PORTF_BASE, GPIO_PIN_3,
            MAP_GPIOPinRead(GPIO_PORTF_BASE, GPIO_PIN_3) ^ GPIO_PIN_3);
    }
}

//*****************************************************************************
// Peripheral initialization
//*****************************************************************************
static void
ConfigureSystemClock(void)
{
    //
    // 80 MHz: 16MHz xtal -> PLL 400MHz -> /2 -> /2.5 = 80MHz
    //
    MAP_SysCtlClockSet(SYSCTL_SYSDIV_2_5 | SYSCTL_USE_PLL |
                       SYSCTL_OSC_MAIN | SYSCTL_XTAL_16MHZ);
}

static void
ConfigureGPIO(void)
{
    MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOB);
    MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOD);
    MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOE);
    MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOF);

    while(!MAP_SysCtlPeripheralReady(SYSCTL_PERIPH_GPIOF)) {}

    //
    // Unlock PF0 (NMI pin) so it can be used as SW2 button input
    //
    HWREG(GPIO_PORTF_BASE + GPIO_O_LOCK) = GPIO_LOCK_KEY;
    HWREG(GPIO_PORTF_BASE + GPIO_O_CR) |= GPIO_PIN_0;
    HWREG(GPIO_PORTF_BASE + GPIO_O_LOCK) = 0;

    //
    // RGB LED outputs: PF1 (Red), PF2 (Blue), PF3 (Green)
    //
    MAP_GPIOPinTypeGPIOOutput(GPIO_PORTF_BASE,
                              GPIO_PIN_1 | GPIO_PIN_2 | GPIO_PIN_3);

    //
    // SW1 (PF4) and SW2 (PF0): active low, internal pull-up
    //
    MAP_GPIOPinTypeGPIOInput(GPIO_PORTF_BASE, GPIO_PIN_4 | GPIO_PIN_0);
    MAP_GPIOPadConfigSet(GPIO_PORTF_BASE, GPIO_PIN_4 | GPIO_PIN_0,
                         GPIO_STRENGTH_2MA, GPIO_PIN_TYPE_STD_WPU);

    //
    // USB pins: PD4 (D-), PD5 (D+)
    //
    MAP_GPIOPinTypeUSBAnalog(GPIO_PORTD_BASE, GPIO_PIN_4 | GPIO_PIN_5);
}

static void
ConfigureADC(void)
{
    MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_ADC0);
    while(!MAP_SysCtlPeripheralReady(SYSCTL_PERIPH_ADC0)) {}

    //
    // PE3 = AIN0
    //
    MAP_GPIOPinTypeADC(GPIO_PORTE_BASE, GPIO_PIN_3);

    //
    // ADC0 Sequencer 3: single sample, Timer0A trigger, highest priority
    //
    MAP_ADCSequenceConfigure(ADC0_BASE, 3, ADC_TRIGGER_TIMER, 0);
    MAP_ADCSequenceStepConfigure(ADC0_BASE, 3, 0,
                                 ADC_CTL_CH0 | ADC_CTL_IE | ADC_CTL_END);
    MAP_ADCSequenceEnable(ADC0_BASE, 3);

    //
    // Enable uDMA for SS3 — DMA request replaces per-sample CPU interrupt.
    // CPU interrupt fires only on DMA buffer completion (every 128 samples).
    //
    ADCSequenceDMAEnable(ADC0_BASE, 3);

    //
    // Interrupt on DMA completion rather than sequence completion.  With uDMA
    // driving SS3 the sequence interrupt is the wrong source: clearing it does
    // not acknowledge the DMA-done condition, so the two can drift apart.
    //
    MAP_ADCIntClearEx(ADC0_BASE, ADC_INT_DMA_SS3 | ADC_INT_SS3);
    MAP_ADCIntEnableEx(ADC0_BASE, ADC_INT_DMA_SS3);
    MAP_IntEnable(INT_ADC0SS3);
}

//*****************************************************************************
// (Re)program both uDMA ping-pong halves and restart the channel.
//
// Used both for first-time setup and by the watchdog to recover a stalled
// pipeline.  Safe to call with the channel already running provided the ADC
// interrupt is masked by the caller.
//*****************************************************************************
static void
ADCPipelineRearm(void)
{
    //
    // Stop the channel and drain anything left in the SS3 FIFO, so the first
    // DMA transfer after the restart is a fresh conversion rather than a stale
    // one captured while the pipeline was wedged.
    //
    MAP_uDMAChannelDisable(UDMA_CHANNEL_ADC3);

    while(!(HWREG(ADC0_BASE + ADC_O_SSFSTAT3) & ADC_SSFSTAT3_EMPTY))
    {
        (void)HWREG(ADC0_BASE + ADC_O_SSFIFO3);
    }

    //
    // Primary control: ADC0 SS3 FIFO -> Buffer A
    // 32-bit transfers, source fixed, dest increment, arb after each transfer
    //
    MAP_uDMAChannelControlSet(UDMA_CHANNEL_ADC3 | UDMA_PRI_SELECT,
        UDMA_SIZE_32 | UDMA_SRC_INC_NONE | UDMA_DST_INC_32 | UDMA_ARB_1);
    MAP_uDMAChannelTransferSet(UDMA_CHANNEL_ADC3 | UDMA_PRI_SELECT,
        UDMA_MODE_PINGPONG,
        (void *)(ADC0_BASE + ADC_O_SSFIFO3),
        g_pui32DMABufA, DMA_BUFFER_SIZE);

    //
    // Alternate control: ADC0 SS3 FIFO -> Buffer B
    //
    MAP_uDMAChannelControlSet(UDMA_CHANNEL_ADC3 | UDMA_ALT_SELECT,
        UDMA_SIZE_32 | UDMA_SRC_INC_NONE | UDMA_DST_INC_32 | UDMA_ARB_1);
    MAP_uDMAChannelTransferSet(UDMA_CHANNEL_ADC3 | UDMA_ALT_SELECT,
        UDMA_MODE_PINGPONG,
        (void *)(ADC0_BASE + ADC_O_SSFIFO3),
        g_pui32DMABufB, DMA_BUFFER_SIZE);

    //
    // Enable the channel — DMA will start on the next ADC trigger
    //
    MAP_ADCIntClearEx(ADC0_BASE, ADC_INT_DMA_SS3);
    MAP_uDMAChannelEnable(UDMA_CHANNEL_ADC3);
}

static void
ConfigureDMA(void)
{
    MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_UDMA);
    while(!MAP_SysCtlPeripheralReady(SYSCTL_PERIPH_UDMA)) {}

