daveyJ-sgs/tm4c_daq/usb_dev_serial/main.c
    MAP_uDMAEnable();
    MAP_uDMAControlBaseSet(g_pui8DMAControlTable);

    //
    // Channel 17 = ADC0 SS3 (default assignment on TM4C123G).
    // Clear all attributes, then enable high priority.
    //
    MAP_uDMAChannelAttributeDisable(UDMA_CHANNEL_ADC3,
        UDMA_ATTR_ALTSELECT | UDMA_ATTR_USEBURST |
        UDMA_ATTR_HIGH_PRIORITY | UDMA_ATTR_REQMASK);
    MAP_uDMAChannelAttributeEnable(UDMA_CHANNEL_ADC3,
        UDMA_ATTR_HIGH_PRIORITY);

    //
    // Program both ping-pong halves and start the channel
    //
    ADCPipelineRearm();
}

static void
ConfigureTimer(void)
{
    MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_TIMER0);
    while(!MAP_SysCtlPeripheralReady(SYSCTL_PERIPH_TIMER0)) {}

    //
    // Full-width periodic timer, hardware ADC trigger output
    //
    MAP_TimerConfigure(TIMER0_BASE, TIMER_CFG_PERIODIC);
    MAP_TimerControlTrigger(TIMER0_BASE, TIMER_A, true);
    TimerApplySampleRate();
}

static void
ConfigurePWM(void)
{
    MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_PWM0);
    while(!MAP_SysCtlPeripheralReady(SYSCTL_PERIPH_PWM0)) {}

    //
    // PB6 = M0PWM0
    //
    MAP_GPIOPinConfigure(GPIO_PB6_M0PWM0);
    MAP_GPIOPinTypePWM(GPIO_PORTB_BASE, GPIO_PIN_6);

    //
    // PWM0 Gen0: count-down mode, no sync
    //
    MAP_PWMGenConfigure(PWM0_BASE, PWM_GEN_0,
                        PWM_GEN_MODE_DOWN | PWM_GEN_MODE_NO_SYNC);

    //
    // Apply initial frequency and duty (10 kHz, 50%)
    //
    PWMApplySettings();
}

static void
ConfigureUSB(void)
{
    USBBufferInit(&g_sTxBuffer);
    USBBufferInit(&g_sRxBuffer);
    USBStackModeSet(0, eUSBModeForceDevice, 0);
    USBDCDCInit(0, &g_sCDCDevice);
}

//*****************************************************************************
// Queue one status triplet [0xFF][ui8B1][ui8B2] for transmission
//*****************************************************************************
static bool
QueueStatus(uint8_t ui8B1, uint8_t ui8B2)
{
    uint8_t ui8Next = (g_ui8StatusHead + 1) & STATUS_QUEUE_MASK;

    //
    // Nothing may be interleaved between the BEGIN triplet and the end of a
    // burst frame -- the host takes the payload as one contiguous run, and a
    // stray echo would shift every sample after it by one triplet.  The frame
    // header is queued while the state is still BURST_FULL, so refusing every
    // caller here is safe.
    //
    if(g_eBurstState == BURST_DRAINING)
    {
        return(false);
    }

    if(ui8Next == g_ui8StatusTail)
    {
        return(false);              // queue full; caller retries later
    }

    g_pui8StatusQueue[g_ui8StatusHead][0] = ui8B1;
    g_pui8StatusQueue[g_ui8StatusHead][1] = ui8B2;
    g_ui8StatusHead = ui8Next;

    return(true);
}

//*****************************************************************************
// Queue a command echo
//*****************************************************************************
static void
SendUSBCommand(uint8_t ui8Cmd)
{
    QueueStatus(ui8Cmd, 0x00);
}

//*****************************************************************************
// Turn the outstanding overflow delta into queued 12-bit status triplets
//*****************************************************************************
static void
QueueOverflowDelta(void)
{
    while(g_ui32ADCOverflow != g_ui32OverflowReported)
    {
        uint32_t ui32Delta = g_ui32ADCOverflow - g_ui32OverflowReported;
        uint16_t ui16Chunk = (ui32Delta > 0x0FFF) ? 0x0FFF : (uint16_t)ui32Delta;

        if(!QueueStatus((uint8_t)(0x80 | ((ui16Chunk >> 8) & 0x0F)),
                        (uint8_t)(ui16Chunk & 0xFF)))
        {
            break;                  // queue full; the rest reports next pass
        }

        g_ui32OverflowReported += ui16Chunk;
    }
}

//*****************************************************************************
// Push queued status triplets into the USB TX buffer, oldest first
//*****************************************************************************
static void
ServiceStatusQueue(void)
{
    while(g_ui8StatusTail != g_ui8StatusHead)
    {
        uint8_t pui8Pkt[3];

        //
        // Only write a whole triplet.  A partial write would shift every later
        // sample by a byte and the protocol has no way to resynchronise.
        //
        if(USBBufferSpaceAvailable(&g_sTxBuffer) < 3)
        {
            return;
        }

        pui8Pkt[0] = 0xFF;
        pui8Pkt[1] = g_pui8StatusQueue[g_ui8StatusTail][0];
        pui8Pkt[2] = g_pui8StatusQueue[g_ui8StatusTail][1];

        USBBufferWrite(&g_sTxBuffer, pui8Pkt, 3);
        g_ui8StatusTail = (g_ui8StatusTail + 1) & STATUS_QUEUE_MASK;
    }
}

//*****************************************************************************
// Free slots in the status queue
//*****************************************************************************
static uint8_t
StatusQueueFree(void)
{
    return((uint8_t)((STATUS_QUEUE_SIZE - 1) -
                     ((g_ui8StatusHead - g_ui8StatusTail) & STATUS_QUEUE_MASK)));
}

//*****************************************************************************
// Arm a capture.  Snapshots the configuration so a setting that arrives
// mid-capture cannot change the geometry of the record being taken.
//*****************************************************************************
static void
BurstArm(bool bContinuous)
{
    uint32_t ui32Len = g_ui16CaptureLen;
    uint32_t ui32Pre = (ui32Len * g_ui8PrePercent) / 100;

    //
    // At least one pre-trigger sample, because the edge test needs a previous
    // sample that belongs to this capture, and at most len-2 so there is
    // always a post-trigger sample left to count down.
    //
    if(ui32Pre < 1)             { ui32Pre = 1; }
    if(ui32Pre > (ui32Len - 2)) { ui32Pre = ui32Len - 2; }

    MAP_IntDisable(INT_ADC0SS3);

    g_ui32ActiveLen    = ui32Len;
    g_ui32ActivePre    = ui32Pre;
    g_ui16ActiveLevel  = g_ui16TrigLevel;
    g_bActiveFalling   = g_bTrigFalling;
    g_ui32BurstWrite   = 0;
    g_ui32BurstFill    = 0;
    g_ui32PostRemain   = 0;
    g_bForceTrigger    = false;
    g_bTrigWasForced   = false;
    g_bBurstContinuous = bContinuous;
    g_ui32ArmTick      = g_ui32SysTickCount;
    g_eBurstState      = BURST_ARMED;

    MAP_IntEnable(INT_ADC0SS3);
}

//*****************************************************************************
// Queue the frame header.  Must be called while still in BURST_FULL, before
// QueueStatus starts refusing.
//*****************************************************************************
static void
BurstQueueHeader(void)
{
    uint8_t ui8Flags = (uint8_t)((g_bActiveFalling ? 0x01 : 0x00) |
                                 (g_bTrigWasForced ? 0x02 : 0x00));

    QueueStatus(0xC1, (uint8_t)(g_ui32ActiveLen >> 8));
    QueueStatus(0xC2, (uint8_t)(g_ui32ActiveLen & 0xFF));
    QueueStatus(0xC3, (uint8_t)(g_ui32ActivePre >> 8));
    QueueStatus(0xC4, (uint8_t)(g_ui32ActivePre & 0xFF));
    QueueStatus(0xC5, g_ui8SampleRateIndex);
    QueueStatus(0xC6, ui8Flags);
    QueueStatus(0xC8, (uint8_t)(g_ui16ActiveLevel >> 8));
    QueueStatus(0xC9, (uint8_t)(g_ui16ActiveLevel & 0xFF));
    QueueStatus(0xC7, 0x00);                // BEGIN, always last
}

//*****************************************************************************
// Push one batch of the captured frame.  Returns true when the frame is done.
//
// Bounded like the streaming drain, and for the same reason: USBBufferWrite
// frees space inside the call, so a loop that only exits on "buffer full"
// never exits at all.
//*****************************************************************************
static bool
BurstDrainBatch(void)
{
    uint32_t ui32Space = USBBufferSpaceAvailable(&g_sTxBuffer);
    uint32_t ui32Limit;
    uint32_t ui32Bytes = 0;

