daveyJ-sgs/tm4c_daq/usb_dev_serial/main.c
    if(ui32Space < 3)
    {
        return(false);
    }

    ui32Limit = (ui32Space < USB_BATCH_BYTES) ? (ui32Space / 3 * 3)
                                              : USB_BATCH_BYTES;

    while((ui32Bytes + 3 <= ui32Limit) && (g_ui32DrainLeft >= 2))
    {
        uint16_t sA = g_pui16ADCBuffer[g_ui32DrainPos];
        g_ui32DrainPos = (g_ui32DrainPos + 1) & ADC_BUFFER_MASK;
        uint16_t sB = g_pui16ADCBuffer[g_ui32DrainPos];
        g_ui32DrainPos = (g_ui32DrainPos + 1) & ADC_BUFFER_MASK;
        g_ui32DrainLeft -= 2;

        if(sA > 4079) { sA = 4079; }
        g_pui8USBBatch[ui32Bytes++] = (uint8_t)(sA >> 4);
        g_pui8USBBatch[ui32Bytes++] = (uint8_t)((sA << 4) | (sB >> 8));
        g_pui8USBBatch[ui32Bytes++] = (uint8_t)(sB);
    }

    if(ui32Bytes)
    {
        USBBufferWrite(&g_sTxBuffer, g_pui8USBBatch, ui32Bytes);
    }

    return(g_ui32DrainLeft == 0);
}

//*****************************************************************************
// Main
//*****************************************************************************
int
main(void)
{
    MAP_FPULazyStackingEnable();

    ConfigureSystemClock();
    ConfigureGPIO();
    ConfigurePWM();
    ConfigureADC();
    ConfigureDMA();
    ConfigureTimer();

    //
    // SysTick for button debounce and heartbeat (100 Hz)
    //
    MAP_SysTickPeriodSet(MAP_SysCtlClockGet() / SYSTICKS_PER_SECOND);
    MAP_SysTickIntEnable();
    MAP_SysTickEnable();

    ConfigureUSB();

    //
    // Interrupt priorities: ADC/DMA completion must re-arm ping-pong promptly.
    // Lower number = higher priority. TM4C123 uses top 3 bits (0x00-0xE0).
    //
    MAP_IntPrioritySet(INT_ADC0SS3, 0x00);      // Highest: ADC sampling
    MAP_IntPrioritySet(INT_USB0, 0x40);          // Medium:  USB transport
    MAP_IntPrioritySet(FAULT_SYSTICK, 0x80);     // Lower:   buttons/heartbeat

    MAP_IntMasterEnable();

    //
    // Main loop
    //
    while(1)
    {
        //
        // Watchdog tripped: the ping-pong stalled and sampling has stopped.
        // Rebuild it with the ADC interrupt masked so the ISR cannot observe a
        // half-programmed channel.
        //
        if(g_bPipelineStalled)
        {
            g_bPipelineStalled = false;
            MAP_IntDisable(INT_ADC0SS3);
            ADCPipelineRearm();
            MAP_IntEnable(INT_ADC0SS3);
            g_ui32StallRecoveries++;
            SendUSBCommand(0xA0 | (uint8_t)(g_ui32StallRecoveries & 0x0F));
        }

        //
        // Report burst state transitions from here rather than from the ISR:
        // the status queue is single-producer by design.  DRAINING is skipped
        // because the host infers it from the header it has just received.
        //
        if(g_bUSBConfigured && (g_eBurstState != g_eReportedState) &&
           (g_eBurstState != BURST_DRAINING))
        {
            if(QueueStatus(0xC0, (uint8_t)g_eBurstState))
            {
                g_eReportedState = g_eBurstState;
            }
        }

        //
        // Burst mode owns g_pui16ADCBuffer while it is engaged, so the
        // streaming path below is skipped entirely.
        //
        if(g_eBurstState != BURST_OFF)
        {
            if(g_bUSBConfigured)
            {
                if(g_eBurstState == BURST_FULL)
                {
                    //
                    // Hand the whole header to the queue in one go, then lock
                    // it by entering DRAINING.  Wait for room rather than
                    // emitting half a header.
                    //
                    ServiceStatusQueue();
                    if(StatusQueueFree() >= 9)
                    {
                        BurstQueueHeader();
                        g_ui32DrainPos   = g_ui32BurstStart;
                        g_ui32DrainLeft  = g_ui32ActiveLen;
                        g_eBurstState    = BURST_DRAINING;
                        g_eReportedState = BURST_DRAINING;
                    }
                }
                else if(g_eBurstState == BURST_DRAINING)
                {
                    //
                    // Header out in full before the first payload byte.
                    //
                    if(g_ui8StatusTail != g_ui8StatusHead)
                    {
                        ServiceStatusQueue();
                    }
                    else if(BurstDrainBatch())
                    {
                        if(g_bBurstContinuous)
                        {
                            BurstArm(true);
                        }
                        else
                        {
                            g_eBurstState = BURST_IDLE;
                        }
                    }
                }
                else
                {
                    ServiceStatusQueue();
                }
            }
            else
            {
                //
                // Host vanished mid-frame.  Drop the partial transfer: the
                // reader that reconnects has no way to resynchronise onto the
                // middle of a record.
                //
                g_ui8StatusTail = g_ui8StatusHead;
                if(g_eBurstState == BURST_DRAINING)
                {
                    g_eBurstState = BURST_IDLE;
                }
            }
        }
        //
        // Batch-drain ADC ring buffer into USB for max throughput.
        // Encode pairs of samples as 3-byte triplets (1.5 bytes/sample),
        // write up to USB_BATCH_BYTES per iteration in one call.
        //
        else if(g_bUSBConfigured)
        {
            uint32_t ui32Tail = g_ui32ADCTail;
            uint32_t ui32Head = g_ui32ADCHead;
            uint32_t ui32Space = USBBufferSpaceAvailable(&g_sTxBuffer);

            //
            // Status first, then exactly ONE batch of samples.
            //
            // The drain loop must stay bounded.  Under saturation the ADC ring
            // never empties, and USBBufferWrite hands bytes straight to the
            // endpoint so TX space never runs out either -- so a loop that
            // exits only on "ring empty" or "buffer full" never exits at all.
            // It spins here writing data and never returns to the top of the
            // main loop, which is why status previously went out at exactly
            // zero packets per second no matter how much space was reserved
            // for it.  One batch per pass keeps status serviced; at 768 bytes
            // a pass the loop still outruns the USB link by orders of
            // magnitude.
            //
            QueueOverflowDelta();
            ServiceStatusQueue();

            if((ui32Tail != ui32Head) && (ui32Space >= 3))
            {
                // Round the limit down to a whole number of triplets
                uint32_t ui32Limit = (ui32Space < USB_BATCH_BYTES)
                                     ? (ui32Space / 3 * 3)
                                     : USB_BATCH_BYTES;
                uint32_t ui32Bytes = 0;

                // Encode pairs of ADC samples: 2 x 12-bit -> 3 bytes
                while((ui32Bytes + 3 <= ui32Limit) &&
                      (ui32Tail != ui32Head) &&
                      (((ui32Tail + 1) & ADC_BUFFER_MASK) != ui32Head))
                {
                    uint16_t sA = g_pui16ADCBuffer[ui32Tail];
                    ui32Tail = (ui32Tail + 1) & ADC_BUFFER_MASK;
                    uint16_t sB = g_pui16ADCBuffer[ui32Tail];
                    ui32Tail = (ui32Tail + 1) & ADC_BUFFER_MASK;
                    // 0xFF is reserved for command triplets, so sA[11:4] must
                    // never reach 0xFF.  Clamp the whole sample rather than just
                    // its high byte: clamping the byte alone folds codes
                    // 4080-4095 back down by 16 counts (non-monotonic).  This
                    // saturates them at 4079 (3.287 V) instead.
                    if(sA > 4079) { sA = 4079; }
                    g_pui8USBBatch[ui32Bytes++] = (uint8_t)(sA >> 4);
                    g_pui8USBBatch[ui32Bytes++] = (uint8_t)((sA << 4) | (sB >> 8));
                    g_pui8USBBatch[ui32Bytes++] = (uint8_t)(sB);
                }

