daveyJ-sgs/tm4c_daq/usb_dev_serial/main.c
                if(ui32Bytes)
                {
                    USBBufferWrite(&g_sTxBuffer, g_pui8USBBatch, ui32Bytes);
                    g_ui32ADCTail = ui32Tail;
                }
            }
        }
        else
        {
            //
            // Not connected: discard samples to prevent overflow
            //
            g_ui32ADCTail = g_ui32ADCHead;
            g_ui32OverflowReported = g_ui32ADCOverflow;
            g_ui8StatusTail = g_ui8StatusHead;   // discard stale status
        }

        //
        // SW1: cycle PWM frequency
        //
        if(g_sButtons[BTN_FREQ].bPressed)
        {
            g_sButtons[BTN_FREQ].bPressed = false;
            g_ui8FreqIndex = (g_ui8FreqIndex + 1) % NUM_FREQ_PRESETS;
            PWMApplySettings();
            SendUSBCommand(0x20 | g_ui8FreqIndex);
        }

        //
        // SW2: cycle PWM duty
        //
        if(g_sButtons[BTN_DUTY].bPressed)
        {
            g_sButtons[BTN_DUTY].bPressed = false;
            g_ui8DutyIndex = (g_ui8DutyIndex + 1) % NUM_DUTY_PRESETS;
            PWMApplySettings();
            SendUSBCommand(0x40 | g_ui8DutyIndex);
        }

        //
        // PC commands: set frequency
        //
        if(g_bCmdFreq)
        {
            g_bCmdFreq = false;
            g_ui8FreqIndex = g_ui8CmdFreqIndex;
            PWMApplySettings();
            SendUSBCommand(0x20 | g_ui8FreqIndex);
        }

        //
        // PC commands: set duty cycle
        //
        if(g_bCmdDuty)
        {
            g_bCmdDuty = false;
            g_ui8DutyIndex = g_ui8CmdDutyIndex;
            PWMApplySettings();
            SendUSBCommand(0x40 | g_ui8DutyIndex);
        }

        //
        // PC commands: burst / trigger action
        //
        if(g_bCmdBurst)
        {
            uint8_t ui8Action = g_ui8BurstAction;
            g_bCmdBurst = false;

            switch(ui8Action)
            {
                case 0:                         // disarm, resume streaming
                    MAP_IntDisable(INT_ADC0SS3);
                    g_eBurstState = BURST_OFF;
                    g_ui32ADCTail = g_ui32ADCHead;
                    MAP_IntEnable(INT_ADC0SS3);
                    g_ui32OverflowReported = g_ui32ADCOverflow;
                    break;

                case 1:                         // arm, single shot
                    BurstArm(false);
                    break;

                case 2:                         // arm, auto-rearm after drain
                    BurstArm(true);
                    break;

                case 3:                         // force the trigger now
                    g_bForceTrigger = true;
                    break;

                default:
                    break;
            }
        }

        //
        // PC commands: set ADC sample rate
        //
        if(g_bCmdSampleRate)
        {
            g_bCmdSampleRate = false;
            g_ui8SampleRateIndex = g_ui8CmdSampleRateIndex;
            TimerApplySampleRate();
            SendUSBCommand(0x60 | g_ui8SampleRateIndex);
        }
    }
}
